In [2]:
from pandas import Series
se=Series([10,20,30])

In [3]:
se

0    10
1    20
2    30
dtype: int64

In [4]:
se[2]

30

In [5]:
se=Series([100,200,300],index=['a','b','c'])

In [6]:
se

a    100
b    200
c    300
dtype: int64

In [7]:
se['c']

300

In [8]:
salary={'john':1000,'abin':4000,'shaun':6000}

In [9]:
a=Series(salary)

In [10]:
a

john     1000
abin     4000
shaun    6000
dtype: int64

In [11]:
a['abin']

4000

In [12]:
from pandas import DataFrame
data={'Name':['john','akhil','jerry'],
      'Age':[20,21,40],
      'Salary':[3000,7000,9000]}

In [13]:
obj=DataFrame(data)

In [14]:
obj

    Name  Age  Salary
0   john   20    3000
1  akhil   21    7000
2  jerry   40    9000

In [15]:
new_frame=DataFrame(obj,columns=['Name','Salary','Age'])

In [16]:
new_frame

    Name  Salary  Age
0   john    3000   20
1  akhil    7000   21
2  jerry    9000   40

In [17]:
new_frame.loc[2]

Name      jerry
Salary     9000
Age          40
Name: 2, dtype: object

In [18]:
frame=DataFrame(new_frame,columns=['Name','Salary','Age','Profile'])

In [19]:
frame

    Name  Salary  Age  Profile
0   john    3000   20      NaN
1  akhil    7000   21      NaN
2  jerry    9000   40      NaN

In [22]:
frame['Profile']='Doctor'

In [23]:
frame

    Name  Salary  Age Profile
0   john    3000   20  Doctor
1  akhil    7000   21  Doctor
2  jerry    9000   40  Doctor

In [24]:
frame.T

              0       1       2
Name       john   akhil   jerry
Salary     3000    7000    9000
Age          20      21      40
Profile  Doctor  Doctor  Doctor